import React from "react";

const ApplyReasonComponent = () => {
  return (
    <div className="container-lg " style={{ paddingTop: "2rem" }}>
      <h3 data-aos="zoom-in" className="Atitle">
        申請的動機
      </h3>
      <div data-aos="fade-right" className="container-lg">
        <p>
          對於程式的興趣是由，Excel開始的，Excel
          有可以創造出數組公式的功能，能用來幫助使用者更高效地處理和分析資料。
          第一次成功創造出屬於自己的、能夠大幅提升工作效率的公式時，那種成就感是無可替代的。
          在我的認知中，工程師面對各種挑戰時，必須以創新的思維來解決問題。
          他們勇於面對複雜的難題，並在克服這些問題後獲得成就感和自豪。這種創新的能力正是我所嚮往的工作環境。我希望能夠投身於工程領域，
          運用我的創造力和技能，解決現實生活中的難題，並不斷追求進步和成長。
          對我來說，工程師的工作不僅是一種職業，更是一種充滿挑戰和機遇的生活態度。我期待著在這個領域中不斷學習與成長，不斷挑戰自己的極限，
          為社會創造更多的價值和貢獻。我相信，成為一位有創新思維的工程師，將帶給我無盡的驕傲和自豪。
          <br />
          <br />
          而我選擇AppWork 的原因主要是 AppWork 向來在歷屆的學員的心得中都是以
          "AppWorks School 的培訓絕對超乎想像的紮實。"，或者是
          "請做好每天會有至少 12 個小時在寫程式的決心。"
          來形容課程。在他們的介紹裡說到，"如果你心目中的想像是，每天會有老師大量上課，然後你就可以按照每天的進度扎實學習，那你就大錯特錯了，
          每天都有作業，基本上每天都在研究新東西，老師只會有簡單的文件講解作業大致內容，剩下的你要自己想辦法"
          對於我來說我正喜歡這一種充滿挑戰的課程，在每一次的實作中可以獲得經驗與知識，比起在課堂上按照進度的學習，更能理解到自身的不足，進而去補足所缺的能力。
          <br />
          <br />
          如同這一份履歷，我的目標雖然是後端，使用React的次數屈指可數，但我嘗試著使用React的功能來創造屬於我自己的前端網站。
          第一次挑戰自己實作前端網站，體認到我在於版面配置與各個module的使用上，還有著許多的不足，但在這之中我嘗試著去構想每一個Component與動畫效果如何去放置，
          深入去理解在Boostrap 與 Bootstrap-react
          的範例與他們在module上是如何去在Class
          中所使用的每個屬性，嘗試著去理解為何他們這樣定義這個class，又或者他們想要給人帶來什麼樣的效果。最終做出了一個這樣一個成品。
        </p>
      </div>
    </div>
  );
};

export default ApplyReasonComponent;
